import { Component, OnInit } from '@angular/core';
import { MatDialog } from '@angular/material/dialog';
import { FinishedComponent } from '../finished/finished.component';

@Component({
  selector: 'app-athkar',
  templateUrl: './athkar.component.html',
  styleUrls: ['./athkar.component.css']
})
export class AthkarComponent implements OnInit {

  home_sc = true
  athkar_sc = false

  fontSize=26
  removeTashkeelFlag = true
  darkmode=false
  constructor(public dialog: MatDialog,) {
    localStorage.getItem("fontSize")?this.fontSize=Number(JSON.parse(localStorage.getItem("fontSize"))):26;
    localStorage.getItem("darkmode")?this.darkmode=(JSON.parse(localStorage.getItem("darkmode"))):false;
    localStorage.getItem("removeTashkeelFlag")?this.removeTashkeelFlag=(JSON.parse(localStorage.getItem("removeTashkeelFlag"))):false;   
   }
  ngOnInit(): void {
  }

  incFont(){
    this.fontSize<38?(this.fontSize=this.fontSize+2):''
    localStorage.setItem("fontSize",JSON.stringify(this.fontSize));
  }
  decFont(){
    this.fontSize>16?(this.fontSize=this.fontSize-2):''
    localStorage.setItem("fontSize",JSON.stringify(this.fontSize));
  }
  togelDarkMode(){
    this.darkmode=!this.darkmode;
    localStorage.setItem("darkmode",JSON.stringify(this.darkmode));
  }



  title=''

  sabaah = [
    {
      title: `  `,
      thikr: `
      الحمدُ للهِ وحدَهُ ، والصَّلاةُ والسَّلامُ على مَن لا نَبِيَّ بعدَهُ
      `,
      description: ``,
      source: [{ book: ``, page: ``, chapter: ` `, number: ` ` }],
      times: 1,
      counter: 0,
    },
    {
    title: `آية الكرسي`,
    thikr: `
    اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيم
    `,
    description: `
    من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح`,
    source: [{ book: ``, page: ``, chapter: `سورة البقرة`, number: `255` }],
    times: 1,
    counter: 0,
  },
  {
    title: `سورة الإخلاص`,
    thikr:
    `
    قُلْ هُوَ اللَّهُ أَحَدٌ ${this.convAyaNum('1')}  اللَّهُ الصَّمَدُ ${this.convAyaNum('2')} لَمْ يَلِدْ وَلَمْ يُولَدْ ${this.convAyaNum('3')} وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ ${this.convAyaNum('4')}
    `,
    description: `من قالها حين يصبح وحين يمسى كفته من كل شىء `,
    source: [{ book: ``, page: ``, chapter: ` سورة الإخلاص`, number: `` }],
    times: 3,
    counter: 0,
  },
  {
    title: `سورة الفلق`,
    thikr: ` قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ${this.convAyaNum('1')} مِنْ شَرِّ مَا خَلَقَ ${this.convAyaNum('2')} وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ ${this.convAyaNum('3')} وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ${this.convAyaNum('4')} وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ ${this.convAyaNum('5')}`,
    description: `من قالها حين يصبح وحين يمسى كفته من كل شىء `,
    source: [{ book: ``, page: ``, chapter: ` سورة الفلق`, number: `` }],
    times: 3,
    counter: 0,
  },
  {
    title: `سورة الناس`,
    thikr: `قُلْ أَعُوذُ بِرَبِّ النَّاسِ ${this.convAyaNum('1')} مَلِكِ النَّاسِ ${this.convAyaNum('2')} إِلَهِ النَّاسِ ${this.convAyaNum('3')} مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ${this.convAyaNum('4')} الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ${this.convAyaNum('5')} مِنَ الْجِنَّةِ وَالنَّاسِ ${this.convAyaNum('6')} `,
    description: `من قالها حين يصبح وحين يمسى كفته من كل شىء `,
    source: [{ book: ``, page: ``, chapter: ` سورة الناس`, number: `` }],
    times: 3,
    counter: 0,
  },
  {
    title: ``,
    thikr: `  أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُ بِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر    `,
    description: ``,
    source: [{ book: ``, page: ``, chapter: ` `, number: `` }],
    times: 1,
    counter: 0,
  },
  {
    title: ``,
    thikr: `اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ، خَلَقْتَنـي وَأَنا عَبْـدُك، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت، أَعـوذُ بِكَ مِنْ شَـرِّ ما صَنَـعْت، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ`,
    description: `من قالها موقناً بها حين يمسي ومات من ليلته دخل الجنة وكذلك حين يصبح`,
    source: [{ book: ``, page: ``, chapter: ` `, number: `` }],
    times: 1,
    counter: 0,
  },
  {
    title: ``,
    thikr: `رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلّى الله عليه وسلّم نَبِيّـاً`,
    description: `من قالها حين يصبح وحين يمسي كان حقاً على الله أن يرضيه يوم القيامة`,
    source: [{ book: ``, page: ``, chapter: ` `, number: `` }],
    times: 3,
    counter: 0,
  },
  {
    title: '',
    thikr: 'اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك، وَمَلَائِكَتَكَ، وَجَمـيعَ خَلْـقِك، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك، وَأَنَّ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك',
    description: ' من قالها أعتقه الله من النار',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 4,
    counter: 0,
  },
  {
    title: '',
    thikr: 'اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر',
    description: ' من قالها حين يصبح أدّى شكر يومه',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 1,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم
    `,
    description: ' من قالها كفاه الله ما أهمّه من أمر الدنيا والآخرة',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 7,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم
    `,
    description: 'لم يضرّه من الله شيء',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 3,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 1,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 1,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه، وَرِضـا نَفْسِـه، وَزِنَـةَ عَـرْشِـه، وَمِـدادَ كَلِمـاتِـه
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 3,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    اللّهُـمَّ عافِـني في بَدَنـي، اللّهُـمَّ عافِـني في سَمْـعي، اللّهُـمَّ عافِـني في بَصَـري، لا إلهَ إلاّ أَنْـتَ
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 3,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر، وَالفَـقْر، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر، لا إلهَ إلاّ أَنْـتَ
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 3,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي، وَمِن فَوْقـي، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 1,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 3,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم، فَـتْحَهُ، وَنَصْـرَهُ، وَنـورَهُ وَبَـرَكَتَـهُ، وَهُـداهُ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 1,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 1,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 3,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد
    `,
    description: '  من صلّى عليّ حين يصبح وحين يمسي أدركته شفاعتي يوم القيامة  ',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 10,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 3,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 3,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 3,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 3,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلً
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 1,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ
    `,
    description: 'كانت له عدل عشر رقاب، وكتبت له مائة حسنة، ومحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 100,
    counter: 0,
  },
  
  {
    title: '',
    thikr:
      `
      اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ
      `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 1,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    سُبْحـانَ اللهِ وَبِحَمْـدِهِ    
    `,
    description: ' حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ  ',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 100,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ
    `,
    description: '   له مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان حتى يُمسي  ',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 100,
    counter: 0,
  },
  ]
  masaa = [{
    title: `  `,
    thikr: `
    الحمدُ للهِ وحدَهُ ، والصَّلاةُ والسَّلامُ على مَن لا نَبِيَّ بعدَهُ
    `,
    description: ``,
    source: [{ book: ``, page: ``, chapter: ` `, number: ` ` }],
    times: 1,
    counter: 0,
  },
  {
    title: ``,
    thikr: `
    آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ
        `,
    description: `
    من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه
    `,
    source: [{ book: ``, page: ``, chapter: `سورة البقرة`, number: `285 - 286` }],
    times: 1,
    counter: 0,
  },
  {
    title: `آية الكرسي`,
    thikr: `
    اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيم
    `,
    description: `
    من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح`,
    source: [{ book: ``, page: ``, chapter: `سورة البقرة`, number: `255` }],
    times: 1,
    counter: 0,
  },
  {
    title: `سورة الإخلاص`,
    thikr:
    `
    قُلْ هُوَ اللَّهُ أَحَدٌ ${this.convAyaNum('1')}  اللَّهُ الصَّمَدُ ${this.convAyaNum('2')} لَمْ يَلِدْ وَلَمْ يُولَدْ ${this.convAyaNum('3')} وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ ${this.convAyaNum('4')}
    `,
    description: `
    من قالها حين يصبح وحين يمسى كفته من كل شىء `,
    source: [{ book: ``, page: ``, chapter: ` سورة الإخلاص`, number: `` }],
    times: 3,
    counter: 0,
  },
  {
    title: `سورة الفلق`,
    thikr: ` قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ${this.convAyaNum('1')} مِنْ شَرِّ مَا خَلَقَ ${this.convAyaNum('2')} وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ ${this.convAyaNum('3')} وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ${this.convAyaNum('4')} وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ ${this.convAyaNum('5')}`,
    description: `
    من قالها حين يصبح وحين يمسى كفته من كل شىء `,
    source: [{ book: ``, page: ``, chapter: ` سورة الفلق`, number: `` }],
    times: 3,
    counter: 0,
  },
  {
    title: `سورة الناس`,
    thikr: `قُلْ أَعُوذُ بِرَبِّ النَّاسِ ${this.convAyaNum('1')} مَلِكِ النَّاسِ ${this.convAyaNum('2')} إِلَهِ النَّاسِ ${this.convAyaNum('3')} مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ${this.convAyaNum('4')} الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ${this.convAyaNum('5')} مِنَ الْجِنَّةِ وَالنَّاسِ ${this.convAyaNum('6')} `,
    description: `
    من قالها حين يصبح وحين يمسى كفته من كل شىء `,
    source: [{ book: ``, page: ``, chapter: ` سورة الناس`, number: `` }],
    times: 3,
    counter: 0,
  },
  {
    title: ``,
    thikr: `  
    أَمْسَيْنا وَأَمْسى الملكُ لله وَالحَمدُ لله، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، وهُوَ على كلّ شَيءٍ قدير، رَبِّ أسْأَلُكَ خَيرَ ما في هذهِ اللَّيْلَةِ وَخَيرَ ما بَعْدَها، وَأَعوذُ بِكَ مِنْ شَرِّ ما في هذهِ اللَّيْلةِ وَشَرِّ ما بَعْدَها، رَبِّ أَعوذُ بِكَ مِنَ الْكَسَلِ وَسوءِ الْكِبَر، رَبِّ أَعوذُ بِكَ مِنْ عَذابٍ في النّارِ وَعَذابٍ في القَبْر    
    `,
    description: ``,
    source: [{ book: ``, page: ``, chapter: ` `, number: `` }],
    times: 1,
    counter: 0,
  },
  {
    title: ``,
    thikr: `اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ، خَلَقْتَنـي وَأَنا عَبْـدُك، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت، أَعـوذُ بِكَ مِنْ شَـرِّ ما صَنَـعْت، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ`,
    description: `من قالها موقناً بها حين يمسي ومات من ليلته دخل الجنة وكذلك حين يصبح`,
    source: [{ book: ``, page: ``, chapter: ` `, number: `` }],
    times: 1,
    counter: 0,
  },
  {
    title: ``,
    thikr: `رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلّى الله عليه وسلّم نَبِيّـاً`,
    description: `من قالها حين يصبح وحين يمسي كان حقاً على الله أن يرضيه يوم القيامة`,
    source: [{ book: ``, page: ``, chapter: ` `, number: `` }],
    times: 3,
    counter: 0,
  },
  {
    title: '',
    thikr: 
    `
    اللّهُمَّ إِنِّي أَمسيتُ أُشْهِدُك، وَأُشْهِدُ حَمَلَةَ عَرْشِك، وَمَلَائِكَتَكَ، وَجَميعَ خَلْقِك، أَنَّكَ أَنْتَ اللهُ لا إلهَ إلاّ أَنْتَ وَحْدَكَ لا شَريكَ لَك، وَأَنَّ مُحَمّداً عَبْدُكَ وَرَسولُك
    `,
    description: ' من قالها أعتقه الله من النار',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 4,
    counter: 0,
  },
  {
    title: '',
    thikr:`
    اللّهُمَّ ما أَمسى بي مِنْ نِعْمَةٍ أَو بِأَحَدٍ مِنْ خَلْقِك، فَمِنْكَ وَحْدَكَ لا شريكَ لَك، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْر	
        `,
    description: ' من قالها حين يصبح أدّى شكر يومه',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 1,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم
    `,
    description: ' من قالها كفاه الله ما أهمّه من أمر الدنيا والآخرة',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 7,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم
    `,
    description: 'لم يضرّه من الله شيء',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 3,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
      اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 1,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
      أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ
          `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 1,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه، وَرِضـا نَفْسِـه، وَزِنَـةَ عَـرْشِـه، وَمِـدادَ كَلِمـاتِـه
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 3,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    اللّهُـمَّ عافِـني في بَدَنـي، اللّهُـمَّ عافِـني في سَمْـعي، اللّهُـمَّ عافِـني في بَصَـري، لا إلهَ إلاّ أَنْـتَ
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 3,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر، وَالفَـقْر، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر، لا إلهَ إلاّ أَنْـتَ
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 3,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي، وَمِن فَوْقـي، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 1,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 3,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
      أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا
          `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 1,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 1,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 3,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد
    `,
    description: '  من صلّى عليّ حين يصبح وحين يمسي أدركته شفاعتي يوم القيامة  ',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 10,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 3,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 3,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 3,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ
    `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 3,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
      اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ
      `,
    description: '',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 1,
    counter: 0,
  },

  {
    title: '',
    thikr:
      `
    لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ
    `,
    description: 'كانت له عدل عشر رقاب، وكتبت له مائة حسنة، ومحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 100,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    سُبْحـانَ اللهِ وَبِحَمْـدِهِ    
    `,
    description: ' حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ  ',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 100,
    counter: 0,
  },
  {
    title: '',
    thikr:
      `
    أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ
    `,
    description: '   له مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان حتى يُمسي  ',
    source: [{ book: '', page: '', chapter: ' ', number: '' }],
    times: 100,
    counter: 0,
  },
  ]
  salah = [
    {
      title: ``,
      thikr: `
      أَسْـتَغْفِرُ الله  
      `,
      description: ``,
      source: [{ book: ``, page: ``, chapter: ``, number: `` }],
      times: 3,
      counter: 0,
    },
    {
      title: ``,
      thikr: `
      اللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام 
  
      `,
      description: ``,
      source: [{ book: ``, page: ``, chapter: ``, number: `` }],
      times: 1,
      counter: 0,
    },
    {
      title: ``,
      thikr: `
      لا إلهَ إلاّ اللّه, وحدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمد، وهوَ على كلّ شيءٍ قدير، لا حَـوْلَ وَلا قـوَّةَ إِلاّ بِاللهِ، لا إلهَ إلاّ اللّـه، وَلا نَعْـبُـدُ إِلاّ إيّـاه, لَهُ النِّعْـمَةُ وَلَهُ الفَضْل وَلَهُ الثَّـناءُ الحَـسَن، لا إلهَ إلاّ اللّهُ مخْلِصـينَ لَـهُ الدِّينَ وَلَوْ كَـرِهَ الكـافِرون
      `,
      description: ``,
      source: [{ book: ``, page: ``, chapter: ``, number: `` }],
      times: 1,
      counter: 0,
    },
    {
    title: `آية الكرسي`,
    thikr: `
    اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيم
    `,
    description: ``,
    source: [{ book: ``, page: ``, chapter: `سورة البقرة`, number: `255` }],
    times: 1,
    counter: 0,
  },
  {
    title: `سورة الإخلاص`,
    thikr:
    `
    قُلْ هُوَ اللَّهُ أَحَدٌ ${this.convAyaNum('1')}  اللَّهُ الصَّمَدُ ${this.convAyaNum('2')} لَمْ يَلِدْ وَلَمْ يُولَدْ ${this.convAyaNum('3')} وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ ${this.convAyaNum('4')}
    `,
    description: `٣ مرات بعد الفجر والمغرب ومرة بعد الصلوات الأخرى`,
    source: [{ book: ``, page: ``, chapter: ` سورة الإخلاص`, number: `` }],
    times: 3,
    counter: 0,
  },
  {
    title: `سورة الفلق`,
    thikr: ` قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ${this.convAyaNum('1')} مِنْ شَرِّ مَا خَلَقَ ${this.convAyaNum('2')} وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ ${this.convAyaNum('3')} وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ${this.convAyaNum('4')} وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ ${this.convAyaNum('5')}`,
    description: `٣ مرات بعد الفجر والمغرب ومرة بعد الصلوات الأخرى`,
    source: [{ book: ``, page: ``, chapter: ` سورة الفلق`, number: `` }],
    times: 3,
    counter: 0,
  },
  {
    title: `سورة الناس`,
    thikr: `قُلْ أَعُوذُ بِرَبِّ النَّاسِ ${this.convAyaNum('1')} مَلِكِ النَّاسِ ${this.convAyaNum('2')} إِلَهِ النَّاسِ ${this.convAyaNum('3')} مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ${this.convAyaNum('4')} الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ${this.convAyaNum('5')} مِنَ الْجِنَّةِ وَالنَّاسِ ${this.convAyaNum('6')} `,
    description: `٣ مرات بعد الفجر والمغرب ومرة بعد الصلوات الأخرى`,
    source: [{ book: ``, page: ``, chapter: ` سورة الناس`, number: `` }],
    times: 3,
    counter: 0,
  },
  {
    title: ``,
    thikr: `
    سُـبْحانَ اللهِ
    `,
    description: ``,
    source: [{ book: ``, page: ``, chapter: ``, number: `` }],
    times: 33,
    counter: 0,
  },
  {
    title: ``,
    thikr: `
     الحَمْـدُ لله
    `,
    description: ``,
    source: [{ book: ``, page: ``, chapter: ``, number: `` }],
    times: 33,
    counter: 0,
  },
  {
    title: ``,
    thikr: `
    اللهُ  أكْـبَر
    `,
    description: ``,
    source: [{ book: ``, page: ``, chapter: ``, number: `` }],
    times: 33,
    counter: 0,
  },
  {
    title: ``,
    thikr: `
    لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ قَـدير
    `,
    description: ``,
    source: [{ book: ``, page: ``, chapter: ``, number: `` }],
    times: 1,
    counter: 0,
  },
  {
    title: ``,
    thikr: `
    اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ
    `,
    description: ` `,
    source: [{ book: ``, page: ``, chapter: ``, number: `` }],
    times: 1,
    counter: 0,
  },
  {
    title: ``,
    thikr: `
    للَّهُمَّ إنِّي أَعُوذُ بِكَ مِنَ الجُبْنِ والْبُخلِ، وَأَعوذُ بِكَ مِنْ أنْ أُرَدَّ إِلَى أرْذَل العُمُرِ، وَأعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيا، وأَعوذُ بِكَ مِنْ فِتْنَةِ القَبر
    `,
    description: `
    كانَ رَسُول اللَّه ﷺ  يَتَعوَّذُ دُبُر الصَّلَواتِ بِهؤلاءِ الكلِمات
    `,
    source: [{ book: ``, page: ``, chapter: ``, number: `` }],
    times: 1,
    counter: 0,
  },
  {
    title: ``,
    thikr: `
    لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير
    `,
    description: `عَشْر مَرّات بَعْدَ المَغْرِب وَالصّـبْح`,
    source: [{ book: ``, page: ``, chapter: ``, number: `` }],
    times: 10,
    counter: 0,
  },
  {
    title: ``,
    thikr: `
    اللّهُـمَّ إِنِّـي أَسْأَلُـكَ عِلْمـاً نافِعـاً وَرِزْقـاً طَيِّـباً ، وَعَمَـلاً مُتَقَـبَّلاً
    `,
    description: `بَعْد السّلامِ من صَلاةِ الفَجْر    `,
    source: [{ book: ``, page: ``, chapter: ``, number: `` }],
    times: 1,
    counter: 0,
  },
  {
    title: ``,
    thikr: `
    اللَّهُمَّ أَجِرْنِي مِنْ النَّار
    `,
    description: `بعد صلاة الصبح والمغرب    `,
    source: [{ book: ``, page: ``, chapter: ``, number: `` }],
    times: 7,
    counter: 0,
  },
  ]
  salahMohamed=[{
    title: `الصلاة علي رسول الله`,
    thikr: `
    اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد
    `,
    description: `
    إنَّ من أفضلِ أيَّامِكُم يومَ الجمعةِ فيهِ خُلِقَ آدمُ وفيهِ قُبِضَ وفيهِ النَّفخةُ وفيهِ الصَّعقةُ فأكْثِروا عليَّ منَ الصَّلاةِ فيهِ فإنَّ صلاتَكُم معروضةٌ
    `,
    source: [{ book: ``, page: ``, chapter: ``, number: `` }],
    times: 1000,
    counter: 0,
  },
  ]
  sleep = [
    {
      title: ``,
      thikr: `
      بِاسْمِكَ رَبِّـي وَضَعْـتُ جَنْـبي ، وَبِكَ أَرْفَعُـه، فَإِن أَمْسَـكْتَ نَفْسـي فارْحَـمْها ، وَإِنْ أَرْسَلْتَـها فاحْفَظْـها بِمـا تَحْفَـظُ بِه عِبـادَكَ الصّـالِحـين      
      `,
      description: ``,
      source: [{ book: ``, page: ``, chapter: ``, number: `` }],
      times: 1,
      counter: 0,
    },
    {
      title: ``,
      thikr: `
      اللّهُـمَّ إِنَّـكَ خَلَـقْتَ نَفْسـي وَأَنْـتَ تَوَفّـاهـا لَكَ ممَـاتـها وَمَحْـياها ، إِنْ أَحْيَيْـتَها فاحْفَظْـها ، وَإِنْ أَمَتَّـها فَاغْفِـرْ لَـها . اللّهُـمَّ إِنَّـي أَسْـأَلُـكَ العـافِـيَة  
      `,
      description: ``,
      source: [{ book: ``, page: ``, chapter: ``, number: `` }],
      times: 1,
      counter: 0,
    },
    {
      title: ``,
      thikr: `
      اللّهُـمَّ قِنـي عَذابَـكَ يَـوْمَ تَبْـعَثُ عِبـادَك
      `,
      description: ``,
      source: [{ book: ``, page: ``, chapter: ``, number: `` }],
      times: 3,
      counter: 0,
    },
    {
      title: ``,
      thikr: `
      بِاسْـمِكَ اللّهُـمَّ أَمـوتُ وَأَحْـيا
      `,
      description: ``,
      source: [{ book: ``, page: ``, chapter: ``, number: `` }],
      times: 1,
      counter: 0,
    },
    {
      title: ``,
      thikr: `
      الـحَمْدُ للهِ الَّذي أَطْـعَمَنا وَسَقـانا، وَكَفـانا، وَآوانا، فَكَـمْ مِمَّـنْ لا كـافِيَ لَـهُ وَلا مُـؤْوي
            `,
      description: ``,
      source: [{ book: ``, page: ``, chapter: ``, number: `` }],
      times: 1,
      counter: 0,
    },
    {
      title: ``,
      thikr: `
      اللّهُـمَّ عالِـمَ الغَـيبِ وَالشّـهادةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كُـلِّ شَـيءٍ وَمَليـكَه، أَشْهـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي، وَمِن شَـرِّ الشَّيْـطانِ وَشِـرْكِه، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم
      `,
      description: ``,
      source: [{ book: ``, page: ``, chapter: ``, number: `` }],
      times: 1,
      counter: 0,
    },
    {
      title: ``,
      thikr: `
      اللّهُـمَّ أَسْـلَمْتُ نَفْـسي إِلَـيْكَ، وَفَوَّضْـتُ أَمْـري إِلَـيْكَ، وَوَجَّـهْتُ وَجْـهي إِلَـيْكَ، وَأَلْـجَـاْتُ ظَهـري إِلَـيْكَ، رَغْبَـةً وَرَهْـبَةً إِلَـيْكَ، لا مَلْجَـأَ وَلا مَنْـجـا مِنْـكَ إِلاّ إِلَـيْكَ، آمَنْـتُ بِكِتـابِكَ الّـذي أَنْزَلْـتَ وَبِنَبِـيِّـكَ الّـذي أَرْسَلْـت
      `,
      description: ``,
      source: [{ book: ``, page: ``, chapter: ``, number: `` }],
      times: 1,
      counter: 0,
    },
    {
      title: ``,
      thikr: `
      آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ
          `,
      description: `
      من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه
      `,
      source: [{ book: ``, page: ``, chapter: `سورة البقرة`, number: `285 - 286` }],
      times: 1,
      counter: 0,
    },
    {
    title: `آية الكرسي`,
    thikr: `
    اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيم
    `,
    description: `أجير من الجن حتى يصبح`,
    source: [{ book: ``, page: ``, chapter: `سورة البقرة`, number: `255` }],
    times: 1,
    counter: 0,
  },
  {
    title: `سورة الإخلاص`,
    thikr:
    `
    قُلْ هُوَ اللَّهُ أَحَدٌ ${this.convAyaNum('1')}  اللَّهُ الصَّمَدُ ${this.convAyaNum('2')} لَمْ يَلِدْ وَلَمْ يُولَدْ ${this.convAyaNum('3')} وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ ${this.convAyaNum('4')}
    `,
    description: `
    كان النبي ﷺ  إذا أوى إلى فراشه كلَّ ليلةٍ جمع كفَّيه، ثم نفث فيهما، فقرأ فيهما 
    ‏:‏ ‏ 'قل هو الله أحد‏ و قل أعوذ برب الفلق و ‏قل أعوذ برب الناس'‏ ومسح ما استطاع من الجسد يبدأ بهما على رأسه ووجه وما أقبل من جسده
    `,
    source: [{book: ` الامام مسلم: كتاب السَّلام`, page: ``, chapter: `  باب رُقية المريض بالمعوّذات والنَّفث`, number: `2192` },{book: ` أخرجه البخاري: كتاب فضائل القرآن`, page: ``, chapter: `  باب فضل المعوّذات`, number: `4630` }],
    times: 3,
    counter: 0,
  },
  {
    title: `سورة الفلق`,
    thikr: ` قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ${this.convAyaNum('1')} مِنْ شَرِّ مَا خَلَقَ ${this.convAyaNum('2')} وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ ${this.convAyaNum('3')} وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ${this.convAyaNum('4')} وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ ${this.convAyaNum('5')}`,
    description: ``,
    source: [{ book: ``, page: ``, chapter: ` سورة الفلق`, number: `` }],
    times: 3,
    counter: 0,
  },
  {
    title: `سورة الناس`,
    thikr: `قُلْ أَعُوذُ بِرَبِّ النَّاسِ ${this.convAyaNum('1')} مَلِكِ النَّاسِ ${this.convAyaNum('2')} إِلَهِ النَّاسِ ${this.convAyaNum('3')} مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ${this.convAyaNum('4')} الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ${this.convAyaNum('5')} مِنَ الْجِنَّةِ وَالنَّاسِ ${this.convAyaNum('6')} `,
    description: ``,
    source: [{ book: ``, page: ``, chapter: ` سورة الناس`, number: `` }],
    times: 3,
    counter: 0,
  },
  {
    title: ``,
    thikr: `
    سُـبْحانَ اللهِ
    `,
    description: ``,
    source: [{ book: ``, page: ``, chapter: ``, number: `` }],
    times: 33,
    counter: 0,
  },
  {
    title: ``,
    thikr: `
     الحَمْـدُ لله
    `,
    description: ``,
    source: [{ book: ``, page: ``, chapter: ``, number: `` }],
    times: 33,
    counter: 0,
  },
  {
    title: ``,
    thikr: `
    اللهُ  أكْـبَر
    `,
    description: ``,
    source: [{ book: ``, page: ``, chapter: ``, number: `` }],
    times: 34,
    counter: 0,
  },
  {
    title: ``,
    thikr: `
    اللهم رب السموات السبع وما أظلت، ورب الأرضين وما أقلت، ورب الشياطين وما أضلت، كن لي جارا من خلقك كلهم جميعا أن يفرط علي أحد منهم أو أن يبغي علي، عز جارك، وجل ثناؤك ولا إله غيرك، ولا إله إلا أنت
    `,
    description: `
     من قلق في فراشه ولم ينم من الأرق
    `,
    source: [{ book: ``, page: ``, chapter: ``, number: `` }],
    times: 1,
    counter: 0,
  },
  {
    title: ``,
    thikr: `
    أعوذ بكلمات الله التامة من غضبه وشر عباده، ومن همزات الشياطين وأن يحضرون    `,
    description: `
    من قلق في فراشه ولم ينم من الأرق
    `,
    source: [{ book: ``, page: ``, chapter: ``, number: `` }],
    times: 1,
    counter: 0,
  },
  ]


  


  athkar=[]

  setAthkar(arr,key){
    this.home_sc=false;
    this.athkar_sc=true
    this.currentThikr=key
    if(localStorage.getItem(key)){
      this.athkar=(JSON.parse(localStorage.getItem(key)))
    }else{
      this.athkar=[]
      this.athkar = JSON.parse(JSON.stringify(arr));
    }
  }
  togelTashkeel(){
    this.removeTashkeelFlag =!this.removeTashkeelFlag
    localStorage.setItem("removeTashkeelFlag",JSON.stringify(this.removeTashkeelFlag));
  }
  removeTashkeel(text){
    // return text.replace(/([^\uFE70-\uFE7F])/g, '');
    // return text.replace(/([^\u0621-\u063A\u0641-\u064A\u0660-\u0669a-zA-Z 0-9 ])/g, '')
    return text.replace(/([\u064B-\u0653\u06D6-\u06DCـ])/g, '');
  }



  currentThikr
  thikrRemove=false
  count(thikr){
    thikr.counter<thikr.times?(thikr.counter = thikr.counter+1) :''
    if(thikr.counter==thikr.times && this.thikrRemove){
      this.athkar.splice(this.athkar.indexOf(thikr),1)
    }
    this.finished()?this.openDialog('finished'):''
  }

  openDialog(caller): void {
    const dialogRef = this.dialog.open(FinishedComponent,{
      height: 'max-content',
      width: '500px',
      disableClose: true,
      data:{'darkmode': this.darkmode,'caller':caller}
    });

    dialogRef.afterClosed().subscribe(result => {
      console.log('The dialog was closed');
      if(result=='end'){
        localStorage.removeItem(this.currentThikr);
      }else{
        localStorage.setItem(this.currentThikr,JSON.stringify(this.athkar));
      }
      this.home_sc=true
      this.athkar_sc=false
    });
  }

  finished(){
    return this.athkar.every(thikr=>thikr.times == thikr.counter)
  }

  convAyaNum(str) {
    var arabicNumbers = ['٠', '١', '٢', '٣', '٤', '٥', '٦', '٧', '٨', '٩']

    // str.replace(/[0-9]/g,/[٠-٩]/g)
    var res = ''
    for (let i = 0; i < str.length; i++) {
      res+= arabicNumbers[Number(str[i])];
    }	
    
    // return "  \u{06DD}  " 
    // return " \u{FD3F} "  + res +" \u{FD3E} "   
    return ' ○ '
  }

  convNum(str) {
    str=str.toString()
    var arabicNumbers = ['٠', '١', '٢', '٣', '٤', '٥', '٦', '٧', '٨', '٩']

    // str.replace(/[0-9]/g,/[٠-٩]/g)
    var res = ''
    for (let i = 0; i < str.length; i++) {
      res+= arabicNumbers[Number(str[i])];
    }
   
    return res     
  }
}